<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------
use \think\Facade\Env;
return [
    // 驱动方式
    'type'   => 'complex',
	'default' => [
		// 驱动方式
		'type'   => 'file',
		// 缓存保存目录
		'path'   => '../runtime/default',
	],
	'file' => [
		'type' => 'file',
		'path' => '../runtime/file',
	],
	'redis' => [
		'type' => 'redis',
		'host' => Env::get('redis.REDIS_HOST','127.0.0.1'),
		'port' => Env::get('redis.REDIS_PORT','6379'),
		'timeout' => 0,
	],
];
